import createSortTest from '../../helpers/createSortTest'
import sort from '../../../src/sort/heapSort'

createSortTest({
  method:sort,
  test:3,
  initSize:1000,
  incrementing:1000,
})

/**
 * exchang*2
 * 
  sort,多次相同序列长度
    √ 第1次,序列长度为：1000 (43ms)
    √ 第2次,序列长度为：1000 (32ms)
    √ 第3次,序列长度为：1000 (24ms)
  sort,不同长度的序列
    √ 第1次,序列长度为：1000 (19ms)
    √ 第2次,序列长度为：2000 (49ms)
    √ 第3次,序列长度为：3000 (81ms)

  console.log console.js:328
    ┌─────────┬──────┬────────┬─────────┬──────────┐
    │ (index) │ size │ native │ compare │ exchange │
    ├─────────┼──────┼────────┼─────────┼──────────┤
    │    0    │ 1000 │ 10132  │  9621   │   9120   │
    │    1    │ 1000 │ 10014  │  9616   │   9115   │
    │    2    │ 1000 │ 10212  │  9553   │   9052   │
    └─────────┴──────┴────────┴─────────┴──────────┘

  console.log console.js:328
    ┌─────────┬──────┬────────┬─────────┬──────────┐
    │ (index) │ size │ native │ compare │ exchange │
    ├─────────┼──────┼────────┼─────────┼──────────┤
    │    0    │ 1000 │  9484  │  9585   │   9084   │
    │    1    │ 2000 │ 22484  │  21227  │  20226   │
    │    2    │ 3000 │ 34071  │  33659  │  32158   │
    └─────────┴──────┴────────┴─────────┴──────────┘
 */