import createSortTest from '../../helpers/createSortTest'
import sort from '../../../src/sort/insertionSort'

createSortTest({
  method:sort,
  test:3,
  initSize:1000,
  incrementing:1000,
})

/**
  insertionSort,多次相同序列长度
    √ 第1次,序列长度为：1000 (383ms)
    √ 第2次,序列长度为：1000 (341ms)
    √ 第3次,序列长度为：1000 (351ms)
  insertionSort,不同长度的序列
    √ 第1次,序列长度为：1000 (342ms)
    √ 第2次,序列长度为：2000 (1336ms)
    √ 第3次,序列长度为：3000 (3186ms)

  console.log console.js:328
    ┌─────────┬──────┬────────┬─────────┬──────────┐
    │ (index) │ size │ native │ compare │ exchange │
    ├─────────┼──────┼────────┼─────────┼──────────┤
    │    0    │ 1000 │ 10089  │ 255150  │  254151  │
    │    1    │ 1000 │  9560  │ 246659  │  245660  │
    │    2    │ 1000 │  9796  │ 248698  │  247699  │
    └─────────┴──────┴────────┴─────────┴──────────┘

  console.log console.js:328
    ┌─────────┬──────┬────────┬─────────┬──────────┐
    │ (index) │ size │ native │ compare │ exchange │
    ├─────────┼──────┼────────┼─────────┼──────────┤
    │    0    │ 1000 │ 10000  │ 251990  │  250991  │
    │    1    │ 2000 │ 21625  │ 1017820 │ 1015821  │
    │    2    │ 3000 │ 33590  │ 2276066 │ 2273067  │
    └─────────┴──────┴────────┴─────────┴──────────┘
 */