import createSortTest from '../../helpers/createSortTest'
import sort from '../../../src/sort/mergeSort'

createSortTest({
  method:sort,
  test:3,
  initSize:1000,
  incrementing:1000,
})

/**
 sort,多次相同序列长度
    √ 第1次,序列长度为：1000 (40ms)
    √ 第2次,序列长度为：1000 (32ms)
    √ 第3次,序列长度为：1000 (22ms)
  sort,不同长度的序列
    √ 第1次,序列长度为：1000 (20ms)
    √ 第2次,序列长度为：2000 (52ms)
    √ 第3次,序列长度为：3000 (102ms)

  console.log console.js:328
    ┌─────────┬──────┬────────┬─────────┬──────────┐
    │ (index) │ size │ native │ compare │ exchange │
    ├─────────┼──────┼────────┼─────────┼──────────┤
    │    0    │ 1000 │  9848  │  9976   │   9976   │
    │    1    │ 1000 │ 10124  │  9976   │   9976   │
    │    2    │ 1000 │ 10077  │  9976   │   9976   │
    └─────────┴──────┴────────┴─────────┴──────────┘

  console.log console.js:328
    ┌─────────┬──────┬────────┬─────────┬──────────┐
    │ (index) │ size │ native │ compare │ exchange │
    ├─────────┼──────┼────────┼─────────┼──────────┤
    │    0    │ 1000 │  9743  │  9976   │   9976   │
    │    1    │ 2000 │ 22776  │  21952  │  21952   │
    │    2    │ 3000 │ 34941  │  34904  │  34904   │
    └─────────┴──────┴────────┴─────────┴──────────┘
 */