import createSortTest from '../../helpers/createSortTest'
import sort from '../../../src/sort/selectionSort'

createSortTest({
  method:sort,
  test:3,
  initSize:1000,
  incrementing:1000,
})

/**
 selectionSort,多次相同序列长度
    √ 第1次,序列长度为：1000 (340ms)
    √ 第2次,序列长度为：1000 (323ms)
    √ 第3次,序列长度为：1000 (303ms)
  selectionSort,不同长度的序列
    √ 第1次,序列长度为：1000 (311ms)
    √ 第2次,序列长度为：2000 (1311ms)
    √ 第3次,序列长度为：3000 (2990ms)

  console.log console.js:328
    ┌─────────┬──────┬────────┬─────────┬──────────┐
    │ (index) │ size │ native │ compare │ exchange │
    ├─────────┼──────┼────────┼─────────┼──────────┤
    │    0    │ 1000 │  9879  │ 499500  │   995    │
    │    1    │ 1000 │ 10090  │ 499500  │   992    │
    │    2    │ 1000 │  9846  │ 499500  │   991    │
    └─────────┴──────┴────────┴─────────┴──────────┘

  console.log console.js:328
    ┌─────────┬──────┬────────┬─────────┬──────────┐
    │ (index) │ size │ native │ compare │ exchange │
    ├─────────┼──────┼────────┼─────────┼──────────┤
    │    0    │ 1000 │  9766  │ 499500  │   995    │
    │    1    │ 2000 │ 22584  │ 1999000 │   1991   │
    │    2    │ 3000 │ 35085  │ 4498500 │   2994   │
    └─────────┴──────┴────────┴─────────┴──────────┘
 */